*> IDENTIFICATION DIVISION.
*> PROGRAM-ID. HELLO-WORLD.
*> PROCEDURE DIVISION.

*> 	INITIALIZE X.
*> 	STOP RUN.
IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.
PROCEDURE DIVISION.
01 TEST
	05 TEST1	PIC 9.
	05 TEST2	PIC X.

	INITIALIZE TEST1.
	INITIALIZE TEST2.

	INITIALIZE TEST